backend/load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Ramp up load"
    - duration: 30
      arrivalRate: 20
      name: "Sustained peak load"
  defaults:
    headers:
      Authorization: "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjZhMWYwY2JmOGI2OTg0YTkxYzJmNTMzMyIsImlhdCI6MTc4MDY2NzgyMywiZXhwIjoxNzgzMjU5ODIzfQ.lqcE0rSA-XN4JyOQ5V0Ccxyu4F-6EC_1prOKvnsphew"

scenarios:
  - name: "Flux de messagerie instantanée"
    flow:
      - get:
          url: "/api/messages/conversations"
      - post:
          url: "/api/messages"
          json:
            receiverId: "65f1a2b3c4d5e6f7a8b9c999" # ID fictif pour le test
            content: "Ceci est un message de test de charge Artillery"
            messageType: "private"
      - patch:
          url: "/api/messages/read"
          json:
            senderId: "65f1a2b3c4d5e6f7a8b9c999"